
const 食べ物一覧 = [
    {id: 600, name: "ﾋﾟｯﾂｧ"},
    {id: 602, name: "ﾈｱﾎﾟﾘｽのﾋﾟｯﾂｧ"},
    {id: 603, name: "くさったﾋﾟｯﾂｧ"},
    {id: 604, name: "ﾎﾟﾙﾎﾟのﾋﾟｯﾂｧ"},
    {id: 605, name: "焦げたﾋﾟｯﾂｧ"},
    {id: 630, name: "娼婦風ｽﾊﾟｹﾞｯﾃｨ"},
    {id: 631, name: "ﾓｯﾂｧﾚﾗﾁｰｽﾞとﾄﾏﾄのｻﾗﾀﾞ"},
    {id: 632, name: "ｷﾘﾏﾝｼﾞｬﾛの雪解け水"},
    {id: 633, name: "子羊背肉のﾘﾝｺﾞｿｰｽかけ"},
    {id: 634, name: "ﾌﾟﾘﾝ"},
    {id: 635, name: "焦げた料理"},
    {id: 636, name: "ｻﾝﾄﾞｲｯﾁ"},
    {id: 639, name: "ｶｴﾙの丸焼き"},
    {id: 640, name: "焦げた食べ物"},
    {id: 641, name: "消し炭"},
    {id: 644, name: "猫バーガー"},
    {id: 645, name: "猫ステーキ"},
    {id: 646, name: "猫ジュース"},
    {id: 647, name: "オレンジ"},
    {id: 648, name: "鎌倉カスター"},
];

const 消費アイテム一覧 = [
    {id: 799, name: "装備＋９９"},
    {id: 650, name: "ｶｴﾙ"},
    {id: 651, name: "大きいｶｴﾙ"},
    {id: 652, name: "ｶｴﾙの死体"},
    {id: 653, name: "超巨大なｶｴﾙ"},
    {id: 654, name: "ﾔﾄﾞｸｶﾞｴﾙ"},
    {id: 655, name: "ｻﾞﾘｶﾞﾆ"},
    {id: 712, name: "やばいクスリ"},
    {id: 713, name: "ﾎﾟﾙﾎﾟのﾗｲﾀｰ"},
    {id: 714, name: "紫外線照射装置"},
    {id: 715, name: "点滴"},
    {id: 716, name: "恐竜の化石"},
    {id: 717, name: "ｺﾋﾟｰ人形の破片"},
    {id: 718, name: "聖なる弓矢"},
    // {id: 719, name: "吉良の弓矢"}, // 没アイテム
    {id: 720, name: "ときのがくぼう"},
    {id: 721, name: "彼女の手首"},
    {id: 722, name: "ｼｰｻﾞｰのﾊﾞﾝﾀﾞﾅ"},
    {id: 723, name: "魔法のランプ"},
    {id: 724, name: "石仮面"},
    {id: 725, name: "ｵﾚｯちのｺｰﾄ"},
    {id: 726, name: "鉄球"},
    {id: 727, name: "ｿﾞﾝﾋﾞ馬"},
    {id: 728, name: "赤石つき石仮面"},
    // {id: 729, name: "吉良の財布"},
    // {id: 730, name: "大家のカバン"},
    // {id: 731, name: "盗まれた財布"},
];

const 記憶DISC一覧 = [

];

const 装備DISC一覧 = [

];

const 射撃DISC一覧 = [

];

const 壺一覧 = [
    {id: 800, name: "ｴﾆｸﾞﾏの紙"},
    {id: 805, name: "ｸﾞｯﾁｮの死体"},
    {id: 806, name: "ｶﾙﾈの死体"},
    {id: 807, name: "DIOの骨"},
    {id: 808, name: "聖人の眼球"},
    {id: 809, name: "聖人の左腕"},
    {id: 815, name: "ｴﾙﾒｪｽのｱﾚ"},
    {id: 816, name: "ﾐｷﾀｶのｶﾊﾞﾝ"},
    {id: 817, name: "乳母車"},
    {id: 850, name: "波紋のツボ"},
    {id: 851, name: "ﾎﾙﾏｼﾞｵのﾋﾞﾝ"},
    {id: 852, name: "ランドセル"},
    {id: 853, name: "ｻｰﾌｨｽ人形"},
    {id: 854, name: "聖人の脊椎"},
    {id: 801, name: "形兆のDISCｹｰｽ"},
    {id: 802, name: "ﾄﾗｸﾀｰのﾀｲﾔ"},
    {id: 803, name: "ｻﾝｼﾞｪﾙﾏﾝの紙袋"},
    {id: 804, name: "露伴のカバン"},
];

const コミック一覧 = [
    {id: 901, name: "1部"},
    {id: 906, name: "2部"},
    {id: 912, name: "3部"},
    {id: 929, name: "4部"},
    {id: 948, name: "5部"},
    {id: 964, name: "6部"},
    {id: 981, name: "7部"},
    {id: 900, name: "GP BOY"},
    {id: 987, name: "バオー来訪者　1巻"},
    {id: 988, name: "バオー来訪者　2巻"},
    {id: 989, name: "魔少年ビーティー"},
    {id: 990, name: "ゴージャス☆アイリン"},
    {id: 991, name: "死刑執行中脱獄進行中"},
    {id: 992, name: "変人偏屈列伝"},
    {id: 993, name: "JOJO 6251"},
    {id: 994, name: "JOJO A GOGO"},
    {id: 995, name: "ピンクダークの少年"},
    {id: 996, name: "ﾋﾛﾋｺのｻｲﾝ色紙"},
];
